console.log('1. Вёрстка валидная +10\n' +
'2. Вёрстка семантическая +11\n' +
'В коде страницы присутствуют следующие элементы (указано минимальное количество, может быть больше):\n' +
'<header>, <main>, <footer> +2.\n' +
'шесть элементов <section> (по количеству секций) +2.\n' +
'только один заголовок <h1> +2.\n' +
'пять заголовков <h2> (легко отличимы на верхних границах секций, имеют единый стиль) +2.\n' +
'один элемент <nav> (панель навигации в хедере) +2.\n' +
'один список ul > li > a (панель навигации) +1.\n')
